cask_args appdir: "/Applications"
# tap "homebrew/core"
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/cask-versions"
# tap "homebrew/services"
# tap "homebrew/cask-fonts"
# tap "homebrew/command-not-found"

# basic
brew "git"
brew "svn"
brew "zsh"
brew "vim"
brew "antigen"
# brew "fvm"
# brew "openjdk@8"
# brew "openjdk@11"
# brew "openjdk@17"
brew "exa"
brew "ack"
brew "trash"

# cask "scroll-reverser"
cask "alfred"
cask "cheatsheet"
cask "spectacle"
# cask "google-chrome"
cask "visual-studio-code"
# cask "android-studio"
cask "iterm2"
cask "miniconda"

cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"

cask "qlcolorcode"  # 代码高亮
cask "qlstephen" # 纯文本格式增强
cask "qlmarkdown" # Markdown 预览
cask "quicklook-json" # JSON 预览
cask "quicklook-csv" # csv 格式预览
cask "qlimagesize" # 标题栏显示图片大小信息
cask "qlvideo"  # 视频缩略图预览
cask "webpquicklook" # webp 格式支持
cask "suspicious-package" # pkg 格式支持

