cask_args appdir: "/Applications"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
# tap "getantibody/tap"

# basic
brew "git"
cask "shadowsocksx-ng"
cask "google-chrome"
cask "visual-studio-code"
cask "scroll-reverser"
cask "sogouinput" # 需要进一步安装 /usr/local/Caskroom/sogouinput/46b,1519980135/安装搜狗输入法.app
cask "alfred"

# brew
brew "openssl"
brew "tmux"
# brew "screen"
# brew "grep"
brew "gnu-sed"
brew "ctags"
brew "autoconf"
brew "cowsay"
brew "automake"
brew "pkg-config"
brew "ack" # 文本搜索 代替grep
brew "bat" # cat的替代品
brew "tldr" # man的替代品
brew "asciinema" # 终端录屏和分享
# brew "asciinema2gif"
brew "cmake"
brew "gnupg"  # enable PGP-signing commits.
brew "mas"
brew "jq"
brew "trash"
brew "tree"
brew "m-cli"
brew "vim", args: ['with-lua', 'with-override-system-vi']
brew "coreutils"
# brew "moreutils"
brew "apktool"
brew "dex2jar"
brew "smali"
brew "jadx"
brew "wget"
brew "git-flow"
brew "hub" # 可以替换git命令的封装工具
brew "neovim"
brew "zsh"
# brew "antibody"
brew "antigen"
brew "diff-so-fancy"
brew "jmeter"
brew "stow"
brew "unrar"
brew "thefuck"
brew "hugo"
brew "exa"
brew "readline"
brew "rbenv"
brew "ruby-build"
brew "libyaml" # for ruby-build to use
brew "libffi" # for ruby-build to use
brew "shellcheck"
brew "align" # 文本对齐
brew "imagemagick", args: ['--with-webp']
brew "ffmpeg"
brew "colordiff"
brew "proxychains-ng"
# brew "kotlin"

# cask
cask "snip"
cask "kap" # 屏幕录制gif
cask "docker"
cask "kdiff3"
cask "jd-gui"
cask "aliwangwang"
cask "tor-browser"
cask "iterm2"
cask "launchrocket"
cask "sourcetree"
cask "dingtalk"
# cask "android-ndk"
# cask "android-sdk"
cask "android-platform-tools"
cask "android-studio"
cask "appcleaner"
cask "calibre"
cask "iina"
cask "steam"
cask "aria2GUI"
cask "mounty"
cask "cheatsheet"
cask "charles"
cask "pycharm"
cask "switchhosts"
cask "flux"
cask "anaconda"
cask "cocoapods-app"
# cask "sip"
cask "spectacle"
cask "dbeaver-community"
# cask "sequel-pro"
cask "db-browser-for-sqlite"
cask "java8"
cask "java10"
cask "java"
brew "gradle"
brew "maven"
cask "postman"
cask "skype"
cask "intellij-idea-ce"
cask "gimp"
cask "tunnelblick"
cask "the-unarchiver"
# cask "vagrant"
cask "nextcloud"
cask "teamviewer"
# cask "arduino"
# cask "zoomus"

# font
cask "font-menlo-for-powerline"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"

# 系统预览增强
cask "qlcolorcode"  # 代码高亮
cask "qlstephen" # 纯文本格式增强
cask "qlmarkdown" # Markdown 预览
cask "quicklook-json" # JSON 预览
cask "quicklook-csv" # csv 格式预览
cask "qlimagesize" # 标题栏显示图片大小信息
cask "webpquicklook" # webp 格式支持
cask "suspicious-package" # pkg 格式支持
cask "qlvideo"  # 视频缩略图预览
cask "quicklookapk"  # apk预览

# brew "mas"
mas "HandShaker", id: 1012930195
mas "WeChat", id: 836500024
mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
# mas "DrCleaner", id: 921458519
mas "Keynote", id: 409183694
mas "Bear", id: 1091189122
mas "Pages", id: 409201541
mas "QQ", id: 451108668
mas "Numbers", id: 409203825
mas "NeteaseMusic", id: 944848654


#
# SpechtLite
# FileZilla
# picgo-appimage ipic
# bartender
# navicat
# omni
# dash
# xmind
# Pixelmator
# Mindnode
# sketch
# anyconnection
# 
