cask_args appdir: "/Applications"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"

# basic
brew "git"
brew "vim", args: [ 'with-override-system-vi']
brew "zsh"
brew "antigen"

brew "diff-so-fancy"
brew "thefuck"
brew "exa"
brew "rbenv"
brew "proxychains-ng"

cask "scroll-reverser"
cask "alfred"
cask "cheatsheet"
cask "spectacle"
cask "google-chrome"
cask "visual-studio-code"
cask "android-studio"
cask "iterm2"
cask "anaconda"


