adobe-source-code-pro-fonts
adobe-source-han-sans-cn-fonts
albert
android-apktool
android-studio
android-tools
android-udev
smali
jadx
noto-fonts-cjk
wqy-bitmapfont
wqy-microhei
wqy-zenhei
aria2
ctags
dbeaver
gimp
coreutils
noto-fonts
ranger
diff-so-fancy
docker
docker-compose
exa
git
google-chrome
jdk8
kdiff3
ms-office-online
neovim
nerd-fonts-complete
netease-cloud-music
nextcloud-client
numix-circle-icon-theme-git
openssh
pycharm-community-edition
rambox-bin
screenfetch
shadowsocks-qt5
stow
scrcpy
terminator
thefuck
trash-cli
sed
okular
highlight
tmux
ttf-anonymous-pro
ttf-dejavu
ttf-font-awesome
ttf-wps-fonts
whois
conky
vim
visual-studio-code-bin
wps-office
xclip
yay
ydcv
zsh
vlc
openssl
ack
bat
tldr
asciinema
gnupg
jq
tree
hub
unrar
hugo
imagemagick
ffmpeg
colordiff
calibre
anaconda
gradle
maven
cowsay
ttf-fira-mono
kotlin
proxychains-ng
shellcheck
postman-bin
intellij-idea-community-edition
sqlitebrowser
