adobe-source-code-pro-fonts
adobe-source-han-sans-cn-fonts
albert
android-apktool
android-studio
android-tools
android-udev
coreutils
ranger
git-delta
git
google-chrome
kdiff3
ms-office-online
neovim
openssh
screenfetch
shadowsocks-qt5
stow
scrcpy
terminator
thefuck
trash-cli
sed
okular
highlight
tmux
whois
conky
vim
visual-studio-code-bin
ttf-wps-fonts
xclip
yay
ydcv
zsh
vlc
openssl
ack
bat
tldr
asciinema
gnupg
jq
tree
hub
unrar
hugo
imagemagick
ffmpeg
colordiff
calibre
anaconda
gradle
maven
cowsay
kotlin
proxychains-ng
shellcheck
postman-bin
intellij-idea-ultimate-edition
sqlitebrowser
rambox-bin
flutter
net-tools
wireshark-qt
minicom
bind-tools
ttf-fira-mono
ttf-fira-code
ttf-anonymous-pro
noto-fonts-cjk
wqy-bitmapfont
wqy-microhei
wqy-zenhei